In [2]:
import sqlite3

In [3]:
conn = sqlite3.connect('INSTRUCTOR.db')

In [4]:
cursor_obj = conn.cursor()

In [6]:
cursor_obj.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [8]:
table = """CREATE TABLE IF NOT EXISTS INSTRUCTOR(
ID INTEGER PRIMARY KEY NOT NULL, 
FNAME VARCHAR(20),
LNAME VARCHAR(20),
CITY VARCHAR(20),
CCODE CHAR(2)
);"""
cursor_obj.execute(table)
print("Table is ready")

Table is ready

In [9]:
cursor_obj.execute(
    '''INSERT INTO INSTRUCTOR VALUES (1, 'Rav', 'Ahuja', 'TORONTO', 'CA')'''
)

In [10]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

In [13]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
print("All the data")
output_all = cursor_obj.fetchall()
for row_all in output_all:
    print(row_all)

All the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

In [15]:
statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
print('all the data')
output_many = cursor_obj.fetchmany(2)
for row_many in output_many:
    print(row_many)

all the data
(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [16]:
statement = '''SELECT FNAME FROM INSTRUCTOR'''
cursor_obj.execute(statement)
print('all the data')
output_column = cursor_obj.fetchall()
for fetch in output_column:
    print(fetch)

all the data
('Rav',)
('Raul',)
('Hima',)

In [20]:
query_update='''update INSTRUCTOR set CITY='MOOSETOWN' where FNAME="Rav"'''
cursor_obj.execute(query_update)

In [22]:

statement = '''SELECT * FROM INSTRUCTOR'''
cursor_obj.execute(statement)
  
print("All the data")
output1 = cursor_obj.fetchmany(2)
for row in output1:
  print(row)

All the data
(1, 'Rav', 'Ahuja', 'MOOSETOWN', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')

In [23]:
# retrieve data into Pandas
import pandas as pd

In [24]:
df = pd.read_sql_query("SELECT * FROM INSTRUCTOR;", conn)
#print the dataframe
df

   ID FNAME      LNAME       CITY CCODE
0   1   Rav      Ahuja  MOOSETOWN    CA
1   2  Raul      Chong    Markham    CA
2   3  Hima  Vasudevan    Chicago    US

In [25]:
# print just the LNAME for first row in the pandas data format
df.LNAME[0]

'Ahuja'

In [26]:
df.LNAME

0        Ahuja
1        Chong
2    Vasudevan
Name: LNAME, dtype: object

In [27]:
df.shape

(3, 5)

In [28]:
#close the connection
conn.close()